<केंद्र><h1>अध्याय 5 परिवर्तन</h1></केंद्र>

In [1]:
import numpy as np
import pandas as pd

## 1. लम्बी और चौड़ी टेबलों का परिवर्तन

एक लंबी तालिका क्या है? एक विस्तृत तालिका क्या है? यह अवधारणा एक निश्चित विशेषता को संदर्भित करती है। उदाहरण के लिए, यदि कोई तालिका किसी स्तंभ में लिंग को संग्रहीत करती है, तो यह लिंग के बारे में एक लंबी तालिका है; यदि लिंग का उपयोग स्तंभ नाम के रूप में किया जाता है कॉलम में तत्व अन्य संबंधित फीचर मान हैं, तो यह तालिका लिंग के बारे में एक विस्तृत तालिका है। निम्नलिखित दो तालिकाएँ क्रमशः लिंग के बारे में लंबी और चौड़ी तालिकाएँ हैं:

In [2]:
pd.DataFrame({'Gender':['F','F','M','M'], 'Height':[163, 160, 175, 180]})

  Gender  Height
0      F     163
1      F     160
2      M     175
3      M     180

In [3]:
pd.DataFrame({'Height: F':[163, 160], 'Height: M':[175, 180]})

   Height: F  Height: M
0        163        175
1        160        180

जाहिर है, ये दोनों तालिकाएँ जानकारी के संदर्भ में पूरी तरह से समान हैं, इनमें समान ऊँचाई के आँकड़े हैं, लेकिन इन मूल्यों की प्रस्तुति अलग है, और प्रस्तुति विधि मुख्य रूप से लिंग कॉलम के लिए चयनित लेआउट मोड से संबंधित है। यानी, चाहे इसे $\color{red}{long}$ या $\color{red}{ width}$ की स्थिति में संग्रहित किया गया हो, इसलिए, `पांडा` ने ऐसी लंबी और चौड़ी तालिका के लिए कुछ प्रासंगिक परिवर्तन फ़ंक्शन डिज़ाइन किए हैं परिवर्तन संचालन.

### 1.पिवोटी

`पिवोट` एक लंबी तालिका को एक विस्तृत तालिका में बदलने के लिए एक विशिष्ट कार्य है। सबसे पहले, आइए एक उदाहरण देखें: निम्नलिखित तालिका झांग सैन और ली सी के चीनी और गणित अंकों को संग्रहीत करती है। अब हम चीनी को प्रदर्शित करना चाहते हैं और गणित के अंक कॉलम के रूप में।

In [4]:
df = pd.DataFrame({'Class':[1,1,2,2],
                   'Name':['San Zhang','San Zhang','Si Li','Si Li'],
                   'Subject':['Chinese','Math','Chinese','Math'],
                   'Grade':[80,75,90,85]})
df

   Class       Name  Subject  Grade
0      1  San Zhang  Chinese     80
1      1  San Zhang     Math     75
2      2      Si Li  Chinese     90
3      2      Si Li     Math     85

बुनियादी लंबाई-से-चौड़ाई ऑपरेशन के लिए, तीन सबसे महत्वपूर्ण तत्व हैं रूपांतरित पंक्ति सूचकांक, स्तंभ को स्तंभ सूचकांक में परिवर्तित किया जाना है, और इन स्तंभ और पंक्ति सूचकांकों से संबंधित मान, जो इसके अनुरूप हैं `पिवट` विधि में `सूचकांक, कॉलम, मान` पैरामीटर। नई जेनरेट की गई तालिका का कॉलम सूचकांक `कॉलम` के संबंधित कॉलम का `अद्वितीय` मान है, और नई तालिका का पंक्ति सूचकांक `अद्वितीय` है `` के संबंधित कॉलम का मानdex`, और `मान` उस संख्यात्मक कॉलम से मेल खाते हैं जिसे आप प्रदर्शित करना चाहते हैं।

In [5]:
df.pivot(index='Name', columns='Subject', values='Grade')

Subject    Chinese  Math
Name
San Zhang       80    75
Si Li           90    85

रंग अंकन से विरूपण प्रक्रिया को समझना आसान हो जाता है:

<img src='../source/_static/ch5_pivot.png' चौड़ाई='20%'>

विशिष्टता की आवश्यकता को पूरा करने के लिए जरूरतों को बदलने के लिए `पिवोट` का उपयोग करना, यानी, चूंकि नई तालिका में पंक्ति और स्तंभ अनुक्रमणिका एक अद्वितीय `मान` के अनुरूप हैं, `सूचकांक` और `कॉलम` का पंक्ति संयोजन दो स्तंभों के अनुरूप है मूल तालिका में अद्वितीय होना चाहिए। उदाहरण के लिए, यदि आप मूल तालिका की दूसरी पंक्ति में झांग सैन के गणित को चीनी में बदलते हैं, तो एक त्रुटि की सूचना दी जाएगी क्योंकि `("सैन झांग", "चीनी")। `नाम` और `सब्जे' के संयोजन में दो बार आता हैct`, इसलिए यह निर्धारित करना असंभव है कि परिवर्तन के बाद इसे 80 अंक या 75 अंक के रूप में भरा जाना चाहिए।

In [6]:
df.loc[1, 'Subject'] = 'Chinese'
try:
    df.pivot(index='Name', columns='Subject', values='Grade')
except Exception as e:
    Err_Msg = e
Err_Msg

ValueError('Index contains duplicate entries, cannot reshape')

पांडा 1.1.0 से शुरू करके, धुरी से संबंधित तीन मापदंडों को सूचियों के रूप में सेट किया जा सकता है, जिसका अर्थ है कि बहु-स्तरीय सूचकांक लौटाए जाएंगे। इसका उपयोग कैसे करें यह बताने के लिए यहां एक उदाहरण दिया गया है: निम्नलिखित तालिका में छह कॉलम वर्ग हैं , नाम, परीक्षा का प्रकार (मध्यावधि परीक्षा और अंतिम परीक्षा), विषय, स्कोर और रैंकिंग।

In [7]:
df = pd.DataFrame({'Class':[1, 1, 2, 2, 1, 1, 2, 2],
                   'Name':['San Zhang', 'San Zhang', 'Si Li', 'Si Li',
                              'San Zhang', 'San Zhang', 'Si Li', 'Si Li'],
                   'Examination': ['Mid', 'Final', 'Mid', 'Final',
                                    'Mid', 'Final', 'Mid', 'Final'],
                   'Subject':['Chinese', 'Chinese', 'Chinese', 'Chinese',
                                 'Math', 'Math', 'Math', 'Math'],
                   'Grade':[80, 75, 85, 65, 90, 85, 92, 88],
                   'rank':[10, 15, 21, 15, 20, 7, 6, 2]})
df

   Class       Name Examination  Subject  Grade  rank
0      1  San Zhang         Mid  Chinese     80    10
1      1  San Zhang       Final  Chinese     75    15
2      2      Si Li         Mid  Chinese     85    21
3      2      Si Li       Final  Chinese     65    15
4      1  San Zhang         Mid     Math     90    20
5      1  San Zhang       Final     Math     85     7
6      2      Si Li         Mid     Math     92     6
7      2      Si Li       Final     Math     88     2

अब हम परीक्षण प्रकार और विषय से बनी चार श्रेणियों (मध्यावधि चीनी, अंतिम चीनी, मध्यावधि गणित, अंतिम गणित) को कॉलम इंडेक्स में स्थानांतरित करना चाहते हैं, और एक ही समय में स्कोर और रैंकिंग की गणना करना चाहते हैं:

In [8]:
pivot_multi = df.pivot(index = ['Class', 'Name'],
                       columns = ['Subject','Examination'],
                       values = ['Grade','rank'])
pivot_multi

                  Grade                     rank
Subject         Chinese       Math       Chinese       Math
Examination         Mid Final  Mid Final     Mid Final  Mid Final
Class Name
1     San Zhang      80    75   90    85      10    15   20     7
2     Si Li          85    65   92    88      21    15    6     2

अद्वितीयता सिद्धांत के अनुसार, नई तालिका का पंक्ति सूचकांक 'सूचकांक' में कई स्तंभों पर 'ड्रॉप_डुप्लिकेट्स' का उपयोग करने के बराबर है, और स्तंभ सूचकांक की लंबाई 'मानों' में तत्वों की संख्या को अद्वितीय की संख्या से गुणा करती है `कॉलम` का संयोजन (`इंडेक्स` के समान) निम्नलिखित आरेख से संबंधित ऑपरेशन को आसानी से समझा जा सकता है:

<img src='../source/_static/ch5_mulpivot.png' चौड़ाई='35%'>

### 2. पिवोट_टेबल

`पिवोट` का उपयोग अद्वितीय पर निर्भर करता हैयदि विशिष्टता की स्थिति पूरी नहीं होती है, तो एक ही पंक्ति और स्तंभ संयोजन के अनुरूप कई मानों को एक मान बनने के लिए एकत्रित किया जाना चाहिए। उदाहरण के लिए, झांग सैन और ली सी दोनों ने दो चीनी और गणित परीक्षाएं दीं कॉलेज के नियमों के अनुसार, अंतिम स्कोर दो परीक्षा अंकों का औसत है, इस समय, इसे 'पिवोट' फ़ंक्शन के माध्यम से पूरा नहीं किया जा सकता है।

In [9]:
df = pd.DataFrame({'Name':['San Zhang', 'San Zhang', 
                              'San Zhang', 'San Zhang',
                              'Si Li', 'Si Li', 'Si Li', 'Si Li'],
                   'Subject':['Chinese', 'Chinese', 'Math', 'Math',
                                 'Chinese', 'Chinese', 'Math', 'Math'],
                   'Grade':[80, 90, 100, 90, 70, 80, 85, 95]})
df

        Name  Subject  Grade
0  San Zhang  Chinese     80
1  San Zhang  Chinese     90
2  San Zhang     Math    100
3  San Zhang     Math     90
4      Si Li  Chinese     70
5      Si Li  Chinese     80
6      Si Li     Math     85
7      Si Li     Math     95

`पांडा` इसे प्राप्त करने के लिए `पिवोट_टेबल` प्रदान करता है, जहां `एगफंक` पैरामीटर उपयोग किया गया एकत्रीकरण फ़ंक्शन है। उपरोक्त परिदृश्य को निम्नानुसार लिखा जा सकता है:

In [10]:
df.pivot_table(index = 'Name',
               columns = 'Subject',
               values = 'Grade',
               aggfunc = 'mean')

Subject    Chinese  Math
Name
San Zhang       85    95
Si Li           75    90

यहां पारित `एगफंक` में पिछले अध्याय में प्रस्तुत सभी कानूनी एकत्रीकरण स्ट्रिंग्स शामिल हैं, इसके अलावा, आप कस्टम संचालन को लागू करने के लिए इनपुट के रूप में एक अनुक्रम और आउटपुट के रूप में एक स्केलर के साथ एक एकत्रीकरण फ़ंक्शन भी पास कर सकते हैं समान रूप से इस प्रकार लिखा गया है:

In [11]:
df.pivot_table(index = 'Name',
               columns = 'Subject',
               values = 'Grade',
               aggfunc = lambda x:x.mean())

Subject    Chinese  Math
Name
San Zhang       85    95
Si Li           75    90

इसके अलावा, `pivot_table` में सीमांत एकत्रीकरण का कार्य है, जिसे `margins=True` सेट करके प्राप्त किया जा सकता है, जहां सीमांत एकत्रीकरण विधि `aggfunc` में दी गई एकत्रीकरण विधि के अनुरूप है। निम्नलिखित आँकड़ों की क्रमशः गणना की जाती है चीनी और गणित के औसत अंक, झांग सैन और ली सी के औसत अंक, और कुल मिलाकर सभी अंकों का औसत अंक:

In [12]:
df.pivot_table(index = 'Name',
               columns = 'Subject',
               values = 'Grade',
               aggfunc='mean',
               margins=True)

Subject    Chinese  Math    All
Name
San Zhang       85  95.0  90.00
Si Li           75  90.0  82.50
All             80  92.5  86.25

#### 【अभ्यास】
उपरोक्त सीमांत सारांश उदाहरण में, पंक्ति या स्तंभ सारांश नई तालिका में पंक्ति तत्वों या स्तंभ तत्वों का औसत है, और समग्र सारांश नई तालिका में चार तत्वों का औसत है। क्या यह संबंध हमेशा कायम रहता है? नहीं, कृपया समझाने के लिए एक उदाहरण दीजिए।
#### 【अंत】
### 3.पिघलना

लंबी और चौड़ी तालिकाएँ डेटा प्रस्तुत करने के तरीके में भिन्न होती हैं, लेकिन उनमें मौजूद जानकारी की मात्रा `पिवोट` का उपयोग करने के बराबर होती हैएक लंबी तालिका को एक विस्तृत तालिका में परिवर्तित करने के लिए, संबंधित व्युत्क्रम ऑपरेशन का उपयोग एक विस्तृत तालिका को लंबी तालिका में परिवर्तित करने के लिए किया जा सकता है। निम्नलिखित उदाहरण में, `पिघल` फ़ंक्शन ऐसी भूमिका निभाता है कॉलम इंडेक्स का रूप, और अब हम इसे एक कॉलम में संपीड़ित करना चाहते हैं।

In [13]:
df = pd.DataFrame({'Class':[1,2],
                   'Name':['San Zhang', 'Si Li'],
                   'Chinese':[80, 90],
                   'Math':[80, 75]})
df

   Class       Name  Chinese  Math
0      1  San Zhang       80    80
1      2      Si Li       90    75

In [14]:
df_melted = df.melt(id_vars = ['Class', 'Name'],
                    value_vars = ['Chinese', 'Math'],
                    var_name = 'Subject',
                    value_name = 'Grade')
df_melted

   Class       Name  Subject  Grade
0      1  San Zhang  Chinese     80
1      2      Si Li  Chinese     90
2      1  San Zhang     Math     80
3      2      Si Li     Math     75

`पिघल` और संपीड़न प्रक्रिया के मुख्य पैरामीटर नीचे दिए गए चित्र में दिखाए गए हैं:

<img src='../source/_static/ch5_melt.png' चौड़ाई='35%'>

जैसा कि पहले उल्लेख किया गया है, `पिघल` और `पिवट` व्युत्क्रम प्रक्रियाओं का एक सेट है, इसलिए यह निश्चित है कि `df_melted` को `पिवट` ऑपरेशन के माध्यम से वापस `df` में परिवर्तित किया जा सकता है:

In [15]:
df_unmelted = df_melted.pivot(index = ['Class', 'Name'],
                              columns='Subject',
                              values='Grade')
df_unmelted # 下面需要恢复索引，并且重命名列索引名称

Subject          Chinese  Math
Class Name
1     San Zhang       80    80
2     Si Li           90    75

In [16]:
df_unmelted = df_unmelted.reset_index().rename_axis(columns={'Subject':''})
df_unmelted.equals(df)

True

### 4. चौड़ा_से_लंबा

`पिघल` विधि में, कॉलम इंडेक्स में संपीड़ित मानों के एक सेट के अनुरूप कॉलम तत्व केवल अर्थ के समान स्तर का प्रतिनिधित्व कर सकते हैं, अर्थात, `वैल्यू_नाम`। अब यदि कॉलम में क्रॉस-श्रेणियां हैं, जैसे कि मध्यावधि और अंतिम परीक्षा की श्रेणियां और चीनी और गणित की श्रेणियां, तो यदि आप क्रमशः चीनी अंकों और गणित के अंकों के अनुरूप दो कॉलमों में `values_name` के अनुरूप `ग्रेड` का विस्तार करना चाहते हैं, और केवल संपीड़ित करते हैंयह मध्यावधि और अंतिम परीक्षाओं की जानकारी है, इस आवश्यकता को पूरा करने के लिए आपको `वाइड_टू_लॉन्ग` फ़ंक्शन का उपयोग करना होगा।

In [17]:
df = pd.DataFrame({'Class':[1,2],'Name':['San Zhang', 'Si Li'],
                   'Chinese_Mid':[80, 75], 'Math_Mid':[90, 85],
                   'Chinese_Final':[80, 75], 'Math_Final':[90, 85]})
df

   Class       Name  Chinese_Mid  Math_Mid  Chinese_Final  Math_Final
0      1  San Zhang           80        90             80          90
1      2      Si Li           75        85             75          85

In [18]:
pd.wide_to_long(df,
                stubnames=['Chinese', 'Math'],
                i = ['Class', 'Name'],
                j='Examination',
                sep='_',
                suffix='.+')

                             Chinese  Math
Class Name      Examination
1     San Zhang Mid               80    90
                Final             80    90
2     Si Li     Mid               75    85
                Final             75    85

विशिष्ट परिवर्तन प्रक्रिया को नीचे दिए गए चित्र में दिखाया गया है। एक ही अवधारणा के तत्वों को एक ही रंग से चिह्नित किया गया है:

<img src='../source/_static/ch5_wtl.png' चौड़ाई='35%'>

निम्नलिखित एक अधिक जटिल उदाहरण है। पिछले अनुभाग `पिवोट` (बहु-स्तरीय सूचकांक उत्पन्न करना) में बहु-स्तंभ ऑपरेशन का परिणाम `वाइड_टू_लॉन्ग` फ़ंक्शन का उपयोग करके अपने मूल रूप में परिवर्तित हो जाता है अध्याय 8 में फ़ंक्शन का उपयोग किया गया है, अभी के लिए इसे अनुक्रम को विभाजित करने के रूप में समझा जा सकता हैई एक निश्चित सीमांकक के अनुसार.

In [19]:
res = pivot_multi.copy()
res.columns = res.columns.map(lambda x:'_'.join(x))
res = res.reset_index()
res = pd.wide_to_long(res, stubnames=['Grade', 'rank'],
                           i = ['Class', 'Name'],
                           j = 'Subject_Examination',
                           sep = '_',
                           suffix = '.+')
res

                                     Grade  rank
Class Name      Subject_Examination
1     San Zhang Chinese_Mid             80    10
                Chinese_Final           75    15
                Math_Mid                90    20
                Math_Final              85     7
2     Si Li     Chinese_Mid             85    21
                Chinese_Final           65    15
                Math_Mid                92     6
                Math_Final              88     2

In [20]:
res = res.reset_index()
res[['Subject', 'Examination']] = res['Subject_Examination'].str.split('_', expand=True)
res = res[['Class', 'Name', 'Examination', 'Subject', 'Grade', 'rank']].sort_values('Subject')
res = res.reset_index(drop=True)
res

   Class       Name Examination  Subject  Grade  rank
0      1  San Zhang         Mid  Chinese     80    10
1      1  San Zhang       Final  Chinese     75    15
2      2      Si Li         Mid  Chinese     85    21
3      2      Si Li       Final  Chinese     65    15
4      1  San Zhang         Mid     Math     90    20
5      1  San Zhang       Final     Math     85     7
6      2      Si Li         Mid     Math     92     6
7      2      Si Li       Final     Math     88     2

## 2. सूचकांक परिवर्तन

### 1. स्टैक और अनस्टैक

अध्याय 2 में, हमने एक सूचकांक के भीतर परतों को स्वैप करने के लिए `swaplevel` या `reorder_levels` का उपयोग करने का उल्लेख किया है, अब हम $\color{red}{row और column indices}$ के आदान-प्रदान पर चर्चा करेंगे 'डेटाफ़्रेम' के आयाम, यह एक परिवर्तन ऑपरेशन है। धारा 1 में उल्लिखित चार परिवर्तन कार्य इस मायने में भिन्न हैं कि वे सभी $\color{red}{Elements' के एक या अधिक स्तंभों के बीच रूपांतरण से संबंधित हैं।}$ और $\color{red}{column indices}$, बजाय सूचकांकों के बीच रूपांतरण के।

`अनस्टैक` फ़ंक्शन का कार्य पंक्ति सूचकांकों को स्तंभ सूचकांकों में परिवर्तित करना है, जैसे कि निम्नलिखित सरल उदाहरण:

In [21]:
df = pd.DataFrame(np.ones((4,2)),
                  index = pd.Index([('A', 'cat', 'big'),
                                    ('A', 'dog', 'small'),
                                    ('B', 'cat', 'big'),
                                    ('B', 'dog', 'small')]),
                  columns=['col_1', 'col_2'])
df

             col_1  col_2
A cat big      1.0    1.0
  dog small    1.0    1.0
B cat big      1.0    1.0
  dog small    1.0    1.0

In [22]:
df.unstack()

      col_1       col_2
        big small   big small
A cat   1.0   NaN   1.0   NaN
  dog   NaN   1.0   NaN   1.0
B cat   1.0   NaN   1.0   NaN
  dog   NaN   1.0   NaN   1.0

`अनस्टैक` का मुख्य पैरामीटर स्थानांतरित की जाने वाली परत संख्या है। डिफ़ॉल्ट रूप से, सबसे भीतरी परत को परिवर्तित किया जाता है और कॉलम इंडेक्स की सबसे निचली परत में ले जाया जाता है। यह एक ही समय में कई परतों को परिवर्तित करने का भी समर्थन करता है।

In [23]:
df.unstack(2)

      col_1       col_2
        big small   big small
A cat   1.0   NaN   1.0   NaN
  dog   NaN   1.0   NaN   1.0
B cat   1.0   NaN   1.0   NaN
  dog   NaN   1.0   NaN   1.0

In [24]:
df.unstack([0,2])

    col_1                  col_2
        A          B           A          B
      big small  big small   big small  big small
cat   1.0   NaN  1.0   NaN   1.0   NaN  1.0   NaN
dog   NaN   1.0  NaN   1.0   NaN   1.0  NaN   1.0

`पिवोट` में विशिष्टता की आवश्यकता के समान, `अनस्टैक` में, यह सुनिश्चित करना आवश्यक है कि $\color{red}{row इंडेक्स लेयर का संयोजन कॉलम इंडेक्स}$ में परिवर्तित हो जाए और $\color{red}{पंक्ति बरकरार रहे इंडेक्स लेयर}$ अद्वितीय है। उदाहरण के लिए, पहले दो कॉलम इंडेक्स को उसी में बदलने से विशिष्टता नष्ट हो जाती है, और एक त्रुटि रिपोर्ट की जाएगी:

In [25]:
my_index = df.index.to_list()
my_index[1] = my_index[0]
df.index = pd.Index(my_index)
df

             col_1  col_2
A cat big      1.0    1.0
      big      1.0    1.0
B cat big      1.0    1.0
  dog small    1.0    1.0

In [26]:
try:
    df.unstack()
except Exception as e:
    Err_Msg = e
Err_Msg

ValueError('Index contains duplicate entries, cannot reshape')

`अनस्टैक` के विपरीत, `स्टैक` का कार्य कॉलम इंडेक्स की परतों को पंक्ति इंडेक्स में स्टैक करना है, और इसका उपयोग बिल्कुल समान है।

In [27]:
df = pd.DataFrame(np.ones((4,2)),
                  index = pd.Index([('A', 'cat', 'big'),
                                    ('A', 'dog', 'small'),
                                    ('B', 'cat', 'big'),
                                    ('B', 'dog', 'small')]),
                  columns=['index_1', 'index_2']).T
df

           A          B
         cat   dog  cat   dog
         big small  big small
index_1  1.0   1.0  1.0   1.0
index_2  1.0   1.0  1.0   1.0

In [28]:
df.stack()

                 A         B
               cat  dog  cat  dog
index_1 big    1.0  NaN  1.0  NaN
        small  NaN  1.0  NaN  1.0
index_2 big    1.0  NaN  1.0  NaN
        small  NaN  1.0  NaN  1.0

In [29]:
df.stack([1, 2])

                     A    B
index_1 cat big    1.0  1.0
        dog small  1.0  1.0
index_2 cat big    1.0  1.0
        dog small  1.0  1.0

### 2. एकत्रीकरण और परिवर्तन के बीच संबंध

ऊपर पेश किए गए सभी कार्यों में, 'पिवोट_टेबल' को छोड़कर, जिसमें एकत्रीकरण प्रभाव होता है, सभी फ़ंक्शन परिवर्तन से पहले और बाद में 'मानों' की संख्या में बदलाव नहीं करेंगे, लेकिन प्रस्तुति के रूप में मान बदल जाएंगे। पिछले अध्याय में चर्चा किया गया समूह एकत्रीकरण ऑपरेशन भी एक विशेष परिवर्तन ऑपरेशन से संबंधित होना चाहिए क्योंकि यह नई पंक्ति और स्तंभ अनुक्रमणिका उत्पन्न करता हैमूल एकाधिक मान एकत्रीकरण के बाद एक मान में परिवर्तित हो जाते हैं, 'मानों' की संख्या बदल जाती है, जो समूह एकत्रीकरण और परिवर्तन कार्यों के बीच सबसे बड़ा अंतर भी है।

## 3. अन्य परिवर्तन कार्य

### 1. क्रॉसटैब

`क्रॉसस्टैब` एक अजीब फ़ंक्शन है क्योंकि यह जो भी कार्य प्राप्त कर सकता है वह `पिवोट_टेबल` द्वारा पूरा किया जा सकता है। डिफ़ॉल्ट स्थिति में, `क्रॉसस्टैब` तत्व संयोजनों की आवृत्ति की गणना कर सकता है, अर्थात, `काउंट` ऑपरेशन। सह`learn_pandas` डेटासेट में स्कूलों और स्थानांतरणों की आवृत्ति:

In [30]:
df = pd.read_csv('../data/learn_pandas.csv')
pd.crosstab(index = df.School, columns = df.Transfer)

Transfer                        N  Y
School
Fudan University               38  1
Peking University              28  2
Shanghai Jiao Tong University  53  0
Tsinghua University            62  4

यह निम्नलिखित `क्रॉसस्टैब` के बराबर है, जहां `एगफंक` एकत्रीकरण पैरामीटर है:

In [31]:
pd.crosstab(index = df.School, columns = df.Transfer, values = [0]*df.shape[0], aggfunc = 'count')

Transfer                          N    Y
School
Fudan University               38.0  1.0
Peking University              28.0  2.0
Shanghai Jiao Tong University  53.0  NaN
Tsinghua University            62.0  4.0

इसी तरह, आप समतुल्य संचालन करने के लिए `pivot_table` का उपयोग कर सकते हैं क्योंकि यहां संयोजनों की आवृत्ति की गणना की जाती है, इससे कोई फर्क नहीं पड़ता कि कौन सा कॉलम `मान` पैरामीटर में पारित किया गया है, यह अंतिम परिणाम को प्रभावित नहीं करेगा:

In [32]:
df.pivot_table(index = 'School',
               columns = 'Transfer',
               values = 'Name',
               aggfunc = 'count')

Transfer                          N    Y
School
Fudan University               38.0  1.0
Peking University              28.0  2.0
Shanghai Jiao Tong University  53.0  NaN
Tsinghua University            62.0  4.0

ऊपर से, हम देख सकते हैं कि इन दो कार्यों के बीच का अंतर यह है कि `क्रॉसस्टैब` की संबंधित स्थिति एक विशिष्ट अनुक्रम में गुजरती है, जबकि `पिवोट_टेबल` यदि अनुक्रम के अनुरूप मूल्य है तो कॉल की गई तालिका के नाम से गुजरती है में पारित, एक त्रुटि की सूचना दी जाएगी।

डिफ़ॉल्ट `गिनती` आँकड़ों के अलावा, सभी कस्टम फ़ंक्शन जो स्ट्रिंग और रिटर्न स्केलर को एकत्रित करते हैं, उपलब्ध हैं, जैसे संबंधित संयोजन की औसत ऊंचाई की गणना करना:

In [33]:
pd.crosstab(index = df.School, columns = df.Transfer, values = df.Height, aggfunc = 'mean')

Transfer                                N       Y
School
Fudan University               162.043750  177.20
Peking University              163.429630  162.40
Shanghai Jiao Tong University  163.953846     NaN
Tsinghua University            163.253571  164.55

### 2. विस्फोट

`विस्फोट` पैरामीटर किसी कॉलम के तत्वों को लंबवत रूप से विस्तारित कर सकता है। विस्तारित की जाने वाली कोशिकाओं को `सूची, टुपल, श्रृंखला, np.ndarray` के बीच एक प्रकार संग्रहीत करना होगा।

In [34]:
df_ex = pd.DataFrame({'A': [[1, 2], 'my_str', {1, 2}, pd.Series([3, 4])],
                      'B': 1})
df_ex

                            A  B
0                      [1, 2]  1
1                      my_str  1
2                      {1, 2}  1
3  0    3
1    4
dtype: int64  1

In [35]:
df_ex.explode('A')

        A  B
0       1  1
0       2  1
1  my_str  1
2       1  1
2       2  1
3       3  1
3       4  1

### 3. डमी प्राप्त करें

`get_dummies` फीचर निर्माण के लिए उपयोग किए जाने वाले महत्वपूर्ण कार्यों में से एक है। इसका कार्य श्रेणीबद्ध विशेषताओं को संकेतक चर में परिवर्तित करना है, और एक निश्चित ग्रेड से संबंधित संबंधित कॉलम को 1 के रूप में चिह्नित किया जाता है , अन्यथा इसे 0 के रूप में चिह्नित किया गया है:

In [36]:
pd.get_dummies(df.Grade).head()

   Freshman  Junior  Senior  Sophomore
0         1       0       0          0
1         1       0       0          0
2         0       0       1          0
3         0       0       0          1
4         0       0       0          1

##4. व्यायाम
### Ex1: अमेरिकी अवैध ड्रग डेटासेट

संयुक्त राज्य अमेरिका में अवैध दवाओं के बारे में एक डेटासेट है, जहां `सब्स्टेंसनेम, ड्रगरिपोर्ट्स` क्रमशः दवा के नाम और रिपोर्ट की संख्या को संदर्भित करता है:

In [37]:
df = pd.read_csv('../data/drugs.csv').sort_values(['State','COUNTY','SubstanceName'],ignore_index=True)
df.head(3)

   YYYY State COUNTY  SubstanceName  DrugReports
0  2011    KY  ADAIR  Buprenorphine            3
1  2012    KY  ADAIR  Buprenorphine            5
2  2013    KY  ADAIR  Buprenorphine            4

1. डेटा को निम्नलिखित प्रारूप में बदलें:

<img src='../source/_static/Ex5_1.png' चौड़ाई='35%'>

2. प्रश्न 1 के परिणाम को मूल तालिका में पुनर्स्थापित करें।
3. प्रत्येक वर्ष के लिए रिपोर्ट की कुल संख्या की गणना 'स्टेट' द्वारा करें, जहां 'स्टेट, वाईवाईवाईवाई' क्रमशः कॉलम इंडेक्स और पंक्ति इंडेक्स हैं। उन्हें लागू करने के लिए क्रमशः दो अलग-अलग रणनीतियों, 'पिवोट_टेबल' फ़ंक्शन और 'ग्रुपबाय+अनस्टैक' का उपयोग करें। , और उनके बीच के संबंध को समझें।

### Ex2: विशेष चौड़ी_से_लंबी विधि

कार्यात्मक रूप से, `पिघल` विधि `वाइड_टू_लॉन्ग` का एक विशेष मामला होना चाहिए, यानी, `स्टबनाम` में केवल एक श्रेणी है`पिघल` अनुभाग में `df_melted` उत्पन्न करने के लिए `वाइड_टू_लॉन्ग` का उपयोग आसानी से करें (संकेत: कॉलम नामों में उचित उपसर्ग जोड़ें)

In [38]:
df = pd.DataFrame({'Class':[1,2],
                   'Name':['San Zhang', 'Si Li'],
                   'Chinese':[80, 90],
                   'Math':[80, 75]})
df

   Class       Name  Chinese  Math
0      1  San Zhang       80    80
1      2      Si Li       90    75